#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t
#+OPTIONS: title:t toc:t todo:t |:t
#+TITLE: Elpy, the Emacs Python Development Environment
#+DATE: <2016-05-24 Tue>
#+AUTHOR: Julien Chastang
#+EMAIL: julien.c.chastang@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.4)

** Obtaining Elpy

You'll first want to add the elpy package manager.

#+BEGIN_SRC emacs-lisp :results none
  (require 'package)
  (add-to-list 'package-archives
               '("elpy" . "https://jorgenschaefer.github.io/packages/"))
  (package-refresh-contents)
#+END_SRC

Search for and download ~elpy~ via the package manager, ~M-x package-list-packages~.

#+BEGIN_SRC emacs-lisp :results verbatim 
  (package-initialize)
  ;; will enable Elpy in all future Python buffers
  (elpy-enable)
#+END_SRC

#+RESULTS:
: (elpy-rpc--disconnect)

You can verify the Python inferior process is working with ~M-x list-process~

